Revit 2027 API
ModelText.Depth Property
The depth of the model text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Depth { get; set; }
Public Property Depth As Double
	Get
	Set
public:
property double Depth {
	double get ();
	void set (double value);
}
member Depth : float with get, set
Property Value
Double
See Also
Reference
ModelText Class
Autodesk.Revit.DB Namespace